#ifndef C_CARD_BOX_H
#define C_CARD_BOX_H

//====================================================================================================
//класс €щика дл€ карты
//====================================================================================================

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================
#include "ccard.h"
#include "crectangle.h"
#include "ccoord.h"
#include <deque>
#include <fstream>
#include <stdint.h>

//====================================================================================================
//класс €щика дл€ карты
//====================================================================================================
class CCardBox
{
 public:
  //-ѕеречислени€--------------------------------------------------------------------------------------- 
  //типы €щиков
  enum CARD_BOX_TYPE
  {
   CARD_BOX_TYPE_MAP,//поле сборки
   CARD_BOX_TYPE_PATIENCE,//расклад
   CARD_BOX_TYPE_MAGAZINE//магазин
  };

  //-ѕеременные-----------------------------------------------------------------------------------------   
  uint32_t Index;//индекс €щика
  CARD_BOX_TYPE Type;//тип €щика
  CRectangle cRectangle_Position;//положение €щика на экране
  CCoord cCoord_CardOffset;//смещение дл€ каждой следующей карты
  std::deque<CCard> deque_CCard;//карты в €щике
 public:
  //- онструктор класса--------------------------------------------------------------------------------- 
  CCardBox(void);
  //-ƒеструктор класса----------------------------------------------------------------------------------
  ~CCardBox();
  //-ќткрытые функции класса----------------------------------------------------------------------------
 public:
  bool IsEmpty(void);//получить,пуст ли €щик
  size_t GetCardAmount(void);//получить количество карт в €щике
  bool SaveState(std::ofstream &file);//сохранить состо€ние
  bool LoadState(std::ifstream &file);//загрузить состо€ние
  CRectangle GetCardRectangle(int32_t card_index);//получить положение на экране карты в €щике в позиции card_index

  bool MoveOneCard(CCardBox &cCardBox_Source);//переместить одну карту из €щика в данный €щик
  void MoveCard(CCardBox &cCardBox_Source,size_t card_amount);//переместить карты в данный €щик
  void MoveCardWithRules(CCardBox &cCardBox_Source,size_t card_amount);//переместить карты с учЄтом правил в данный €щик

  bool IsMap(void);//€вл€етс€ ли €щик полем сборки
  bool IsMagazine(void);//€вл€етс€ ли €щик магазином
  bool IsPatience(void);//€вл€етс€ ли €щик раскладом
  //-«акрытые функции класса----------------------------------------------------------------------------
 protected:
};
#endif