#ifndef C_CARD_H
#define C_CARD_H

//====================================================================================================
//класс карты
//====================================================================================================

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================
#include <stdint.h>
#include <fstream>
#include "ccoord.h"
#include "ivideo.h"
#include "ispritestorage.h"

//====================================================================================================
//класс карты
//====================================================================================================
class CCard
{
 public:
  //-Перечисления--------------------------------------------------------------------------------------- 
  //масти
  enum CARD_SUIT
  {
   //пики
   CARD_SUIT_SPADES,
   //червы
   CARD_SUIT_HEARTS,
   //трефы
   CARD_SUIT_CLUBS,
   //буби
   CARD_SUIT_DIAMONDS
  };
  //значения
  enum CARD_VALUE
  {
   //туз
   CARD_VALUE_A=0,
   //2
   CARD_VALUE_2,
   //3
   CARD_VALUE_3,
   //4
   CARD_VALUE_4,
   //5
   CARD_VALUE_5,
   //6
   CARD_VALUE_6,
   //7
   CARD_VALUE_7,
   //8
   CARD_VALUE_8,
   //9
   CARD_VALUE_9,
   //10
   CARD_VALUE_10,
   //валет
   CARD_VALUE_J,
   //дама
   CARD_VALUE_Q,
   //король
   CARD_VALUE_K
};

  //-Переменные----------------------------------------------------------------------------------------- 
  CARD_SUIT Suit;//масть
  CARD_VALUE Value;//значение карты от двойки до туза
  bool Visible;//true-карта видима  
 public:
  //-Конструктор класса--------------------------------------------------------------------------------- 
  CCard(void);
  //-Деструктор класса----------------------------------------------------------------------------------
  ~CCard();
  //-Открытые функции класса----------------------------------------------------------------------------
 public:
  bool SaveState(std::ofstream &file);//сохранить состояние
  bool LoadState(std::ifstream &file);//загрузить состояние
  void Draw(const CCoord &cCoord,IVideo *iVideo_Ptr,ISpriteStorage *iSpriteStorage_Ptr);//отрисовать карту
  //-Закрытые функции класса----------------------------------------------------------------------------
 protected:
};
#endif