#ifndef C_CARD_H
#define C_CARD_H

//====================================================================================================
//класс карты
//====================================================================================================

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================
#include <stdint.h>
#include <fstream>
#include "ccoord.h"
#include "ivideo.h"
#include "ispritestorage.h"

//====================================================================================================
//класс карты
//====================================================================================================
class CCard
{
 public:
  //-Перечисления--------------------------------------------------------------------------------------- 
  //масти
  enum CARD_SUIT
  {
   //пики
   CARD_SUIT_SPADES,
   //червы
   CARD_SUIT_HEARTS,
   //трефы
   CARD_SUIT_CLUBS,
   //буби
   CARD_SUIT_DIAMONDS
  };
  //-Переменные----------------------------------------------------------------------------------------- 
  CARD_SUIT Suit;//масть
  int32_t Value;//значение карты от двойки до туза
  bool Visible;//true-карта видима  
 public:
  //-Конструктор класса--------------------------------------------------------------------------------- 
  CCard(void);
  //-Деструктор класса----------------------------------------------------------------------------------
  ~CCard();
  //-Открытые функции класса----------------------------------------------------------------------------
 public:
  bool SaveState(std::ofstream &file);//сохранить состояние
  bool LoadState(std::ifstream &file);//загрузить состояние
  void Draw(const CCoord &cCoord,IVideo *iVideo_Ptr,ISpriteStorage *iSpriteStorage_Ptr);//отрисовать карту
  //-Закрытые функции класса----------------------------------------------------------------------------
 protected:
};
#endif