#ifndef C_CURSOR_H
#define C_CURSOR_H

//====================================================================================================
//класс курсора
//====================================================================================================

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================
#include "ccoord.h"
#include "consts.h"
#include <fstream>
#include <stdint.h>


//====================================================================================================
//класс курсора
//====================================================================================================
class CCursor
{
 public:
  //-Переменные-----------------------------------------------------------------------------------------   
  CCoord cCoord_Position;//позиция курсора
  bool MoveMode;//флаг режима перемещения
  int32_t SelectedBoxIndex;//выбранный ящик
  int32_t SelectedPositionIndexInBox;//выбранная ячейка ящика
  CCoord cCoord_OffsetWithSelectedPosition;//смещение курсора относительно выбранной ячейки ящика
  uint8_t PatienceNumber[NConsts::PATIENCE_NUMBER_AMOUNT];//номер пасьянса
 public:
  //-Конструктор класса--------------------------------------------------------------------------------- 
  CCursor(void);
  //-Деструктор класса----------------------------------------------------------------------------------
  ~CCursor();
  //-Открытые функции класса----------------------------------------------------------------------------
 public:
  void Init(void);//инициализировать
  void ResetSelected(void);//сбросить выбор
  bool SaveState(std::ofstream &file);//сохранить состояние
  bool LoadState(std::ifstream &file);//загрузить состояние
  //-Закрытые функции класса----------------------------------------------------------------------------
 protected:
};
#endif