#ifndef CONSTS_H
#define CONSTS_H

//====================================================================================================
//константы
//====================================================================================================

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================

//====================================================================================================
//константы
//====================================================================================================
namespace NConsts
{
 static const uint32_t NUMBER_AMOUNT=10;//количество цифр
 static const uint32_t CARD_COLOR_AMOUNT=4;//количество мастей
 static const uint32_t CARD_UNIT_AMOUNT=14;//количество типов карт

 static const uint32_t BOX_WIDTH=30;//размер поля по X
 static const uint32_t BOX_0_1_OFFSET_X=5;//положение ящиков 0 и 2 по X и Y
 static const uint32_t BOX_0_1_OFFSET_Y=5;
 static const uint32_t BOX_2_8_OFFSET_X=5;//положение ящиков с 2 по 8 по X и Y
 static const uint32_t BOX_2_8_OFFSET_Y=45;
 static const uint32_t BOX_9_12_OFFSET_X=95;//положение ящиков с 9 по 12 по X и Y
 static const uint32_t BOX_9_12_OFFSET_Y=5;
 static const uint32_t CARD_DX_OFFSET=10;//смещение каждой следующей карты вниз 
 static const uint32_t SIZE_SCALE=2;//масштабный коэффициент относительно размеров карт на PSP
 static const uint32_t CARD_WIDTH=27;//размер карты по X
 static const uint32_t CARD_HEIGHT=37;//размер карты по Y
}

#endif
