#ifndef C_RECTANGLE_H
#define C_RECTANGLE_H

//====================================================================================================
//класс прямоугольной области
//====================================================================================================

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================
#include "ccoord.h"
#include <stdint.h>

//====================================================================================================
//класс прямоугольной области
//====================================================================================================
class CRectangle
{
 public:
  //-Переменные----------------------------------------------------------------------------------------- 
  CCoord cCoord_Position;//положение на экране
  CCoord cCoord_Size;//размер
 public:
  //-Конструктор класса--------------------------------------------------------------------------------- 
  CRectangle(void);
  CRectangle(const CCoord &cCoord_position,const CCoord &cCoord_size);
  //-Деструктор класса----------------------------------------------------------------------------------
  ~CRectangle();
  //-Открытые функции класса----------------------------------------------------------------------------
 public:
  bool IsPointInside(CCoord cCoord);//находится ли точка внутри
  void Set(const CCoord &cCoord_position,const CCoord &cCoord_size);//задать координаты
  int32_t GetLeftX(void);//получить левое значение координаты X
  int32_t GetTopY(void);//получить верхнее значение координаты Y
  int32_t GetRightX(void);//получить правое значение координаты X
  int32_t GetBottomY(void);//получить нижнее значение координаты Y
  //-Закрытые функции класса----------------------------------------------------------------------------
 protected:
};
#endif