#ifndef C_VIDEO_H
#define C_VIDEO_H

//====================================================================================================
//класс видеопамяти
//====================================================================================================

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================

#include <stdint.h>
#include "ivideo.h"

//====================================================================================================
//класс видеопамяти
//====================================================================================================
class CVideo:public IVideo
{
 private:
  //-Переменные-----------------------------------------------------------------------------------------
  uint32_t *VideoBuffer;//видеобуфер
  uint32_t LineSize;//длина строки
  uint32_t ScreenWidth;//ширина экрана
  uint32_t ScreenHeight;//высота экрана
  uint32_t WindowHeight;//высота окна
  uint32_t WindowXCenter;//координаты центра окна
  uint32_t WindowYCenter;//координаты центра окна

  static const uint32_t FONT_WIDTH=8;//ширина шрифта
  static const uint32_t FONT_HEIGHT=14;//высота шрифта
 public:
  //-Конструктор класса---------------------------------------------------------------------------------
  CVideo(uint32_t width,uint32_t height);
  //-Деструктор класса----------------------------------------------------------------------------------
  ~CVideo();
 public:
  //-Открытые функции класса----------------------------------------------------------------------------
  void Init(void);//инициализизация видеорежима
  void Close(void);//возврат в текстовый режим
  void GetScreenSize(uint32_t &width,uint32_t &height) const;//получить размеры экрана
  void GetWindowSize(uint32_t &width,uint32_t &height) const;//получить размеры окна
  void GetWindownCenter(uint32_t &xcenter,uint32_t &ycenter) const;//получить центр окна
  void GetVideoPointer(uint32_t* &vptr,uint32_t &linesize) const;//получить указатель на видеобуфер
  void SetVideoPointer(uint32_t* vptr,uint32_t linesize);//задать указатель на видеобуфер
  void PutSymbol(uint32_t x,uint32_t y,char symbol,uint32_t color);//вывод символа в позицию
  void PutString(uint32_t x,uint32_t y,const char *string,uint32_t color);//вывод строчки в позицию
  void DrawPoint(uint32_t x,uint32_t y,uint32_t color);//вывод точки
  //-Закрытые функции класса----------------------------------------------------------------------------
};
#endif
