#ifndef I_SPRITE_STORAGE_H
#define I_SPRITE_STORAGE_H

//====================================================================================================
//интерфейсный класс хранилища спрайтов
//====================================================================================================

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================

#include "isprite.h"

//====================================================================================================
//интерфейсный класс хранилища спрайтов
//====================================================================================================
class ISpriteStorage
{
 public:
  //-Деструктор-----------------------------------------------------------------------------------------
  virtual ~ISpriteStorage() {};
 public:
  //-Открытые функции класса----------------------------------------------------------------------------  
  virtual ISprite* GetSpriteCardPtr(uint32_t cart,uint32_t color) const =0;//получить указатель на спрайт карты
  virtual ISprite* GetSpritePointerPtr(void) const =0;//получить указатель на спрайт указателя
  virtual ISprite* GetSpriteDesktopPtr(void) const =0;//получить указатель на спрайт фона
  virtual ISprite* GetSpriteBackPtr(void) const =0;//получить указатель на спрайт рубашки карты
  virtual ISprite* GetSpriteNumberPtr(uint32_t number) const =0;//получить указатель на спрайт цифры
  virtual ISprite* GetSpriteNumberFramePtr(void) const =0;//получить указатель на спрайт рамки цифр
  virtual ISprite* GetSpriteSaveStatePtr(void) const =0;//получить указатель на спрайт "сохранить состояние"
  virtual ISprite* GetSpriteLoadStatePtr(void) const =0;//получить указатель на спрайт "загрузить состояние"
  virtual ISprite* GetSpriteStartPtr(void) const =0;//получить указатель на спрайт "сдать колоду"
  virtual ISprite* GetSpriteWinPtr(void) const =0;//получить указатель на спрайт "вы победили"
};

#endif