#ifndef I_VIDEO_H
#define I_VIDEO_H

//====================================================================================================
//интерфейсный класс видеопамяти
//====================================================================================================

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================

#include <stdint.h>

//====================================================================================================
//интерфейсный класс видеопамяти
//====================================================================================================
class IVideo
{
 public:
  //-Деструктор класса----------------------------------------------------------------------------------
  virtual ~IVideo() {};//деструктор
 public:
  //-Открытые функции класса----------------------------------------------------------------------------
  virtual void Init(void)=0;//инициализизация видеорежима
  virtual void Close(void)=0;//возврат в текстовый режим
  virtual void GetScreenSize(uint32_t &width,uint32_t &height) const =0;//получить размеры экрана
  virtual void GetWindowSize(uint32_t &width,uint32_t &height) const =0;//получить размеры окна
  virtual void GetWindownCenter(uint32_t &xcenter,uint32_t &ycenter) const =0;//получить центр окна
  virtual void GetVideoPointer(uint32_t* &vptr,uint32_t &linesize) const =0;//получить указатель на видеобуфер
  virtual void SetVideoPointer(uint32_t* vptr,uint32_t linesize)=0;//задать указатель на видеобуфер
  virtual void PutSymbol(uint32_t x,uint32_t y,char symbol,uint32_t color)=0;//вывод символа в позицию
  virtual void PutString(uint32_t x,uint32_t y,const char *string,uint32_t color)=0;//вывод строчки в позицию
  virtual void DrawPoint(uint32_t x,uint32_t y,uint32_t color)=0;//вывод точки
  //-Закрытые функции класса----------------------------------------------------------------------------
};
#endif
